
def quiz():
    begin=input('Добро пожаловать на викторину по биологии.\nПриступим: 1-да, 2-нет,хочу выйти\n')
    if begin==2:
        exit()
    elif begin==1:
        input('Кто является хранителем наследственной информации:\n1- ДНК\n2-мРНК\n3-иРНК\n4-Ядро клетки\n')
        input('Химическая формула глюкозы:\n 1-C6H12O6\n2-C5HOOH\n3-C4H12OH\n4-C6H12OH')
        input('Что такое транскрипция:1-это транскрипция\n2-это разбор слова на звуки в английском\n3- переписывание генетической информации молекулы ДНК на мРНК(иРНК)\n4-этотворческая адаптация музыкального произведения для другого, по сравнению с оригиналом, инструмента (голоса, группы инструментов) или его вольная, часто виртуозная, обработка. ')
        input('Кто такие гидрофобы:\n1-липиды, жиры, нерастворимые соли, некоторые белки\n2-соли, сахара, аминокислоты\n3-люди, которые страшатся воды\n4-один из акул\n')
        input('Какие функции выполняют белки:\n1-энергетическая, защитная, строительная, питательная\n2-строительная, питательная, рецепторная, защитная\n3-структурная, каталитическая\n4-структурная, ферментативная,регуляторная, рецепторная, транспортная,энергетическая, защитная\n')
        input('Какова должна быть температура живых организмов:\n1-50\N{DEGREE SIGN}\n2-не выше 40\N{DEGREE SIGN}\n3-менее 36\N{DEGREE SIGN}\n4-не более 28\N{DEGREE SIGN}')
        
       
