A = list('АБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ')
a = list('абвгдежзийклмнопрстуфхцчшщъыьэюя')  
Morze = list([".-","-...",".--","--.","-..",".","...-","--..","..",".---","-.-",".-..","--","-","---",".--.",".-.","...","-","..-","..-.","....","-.-.","---.","----","--.-",".--.-","-.--","-..-","..-..","..--",".-.-"])
InpS = input('Введите исходную строку: ')
OutS = str('')
for i in range(1, (len(InpS)+1)):
    for j in range (1, 32):
        if (InpS[i-1] == str(A[j-1])) or (InpS[i-1] == str(a[j-1])):
            OutS = OutS + str(Morze[j-1]) + ' '
print('Ваша строка, перекодированная на азбуку Морзе: ' +OutS)
